app/controllers/api/characters_controller.rb

SELECT "characters".* FROM "characters"
---
  def index
    characters = Character.all

SELECT "characters".* FROM "characters" WHERE "characters"."user_id" = ?  [["user_id", 1]]
---
  def default_char
    default_characters = Character.where(user_id:1)

INSERT INTO "characters" ("char_name", "char_desc", "char_class", "char_health", "char_armor", "char_speed", "char_sneak", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    new_character = Character.create(character_params)