app/controllers/api/encounters_controller.rb

SELECT "encounters".* FROM "encounters"
---
  def index
    encounters = Encounter.all