app/controllers/api/enemies_controller.rb

SELECT "enemies".* FROM "enemies"
---
  def index
    @enemies = Enemy.all