app/controllers/api/items_controller.rb

INSERT INTO "items" ("item_name", "item_desc", "item_class", "character_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    new_item = Item.create(item_params)