app/controllers/api/searches_controller.rb

SELECT "searches".* FROM "searches"
---
  def index
    searches = Search.all