app/controllers/api/skills_controller.rb

  def index
    skills = Skill.all
---
SELECT "skills".* FROM "skills"