app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    selected_user = User.find_by(id: session[:user_id])

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "pierce"], ["password_digest", "[FILTERED]"], ["created_at", "2022-03-25 19:25:31.041235"], ["updated_at", "2022-03-25 19:25:31.041235"]]
---
  def create
    new_user = User.create(user_params)